# GetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalEventHandler..::..GetName Method
IExternalEventHandler Interface See Also
---
String identification of the event handler.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
string GetName()
```

Visual Basic
---
```text
Function GetName As String
```

Visual C++
---
```text
String^ GetName()
```

# ### Return Value
The event's name
# See Also
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace